kokoory/mm-iot-esp32/esp32p4_heli_fc/sdkconfig.defaults
#
# ESP32-P4 Helicopter Flight Controller — sdkconfig defaults
# Based on working reference: examples/esp32p4halow/sdkconfig.defaults
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── SPIRAM (camera frame buffers + task stacks) ──
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# ── FreeRTOS (matching reference exactly) ──
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_PRIORITY=10

# ── LWIP (required by mmipal + morselib networking) ──
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_DHCP6=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_NETIF_LINK_CALLBACK=y
CONFIG_LWIP_TCP_MSS=1460
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8760
CONFIG_LWIP_TCP_WND_DEFAULT=14600
CONFIG_LWIP_TCP_RECVMBOX_SIZE=10
CONFIG_LWIP_UDP_RECVMBOX_SIZE=10

# ── MBEDTLS (HaLow SAE authentication) ──
CONFIG_MBEDTLS_NIST_KW_C=y

# ── Timer profiling (matching reference) ──
CONFIG_ESP_TIMER_PROFILING=y

# ── Logging (use RTOS ticks for timestamps — system time triggers
#    _tzset_unlocked_r from ISR context causing lock_acquire_generic abort) ──
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL=5
CONFIG_LOG_COLORS=y
